[
    {
        "title": "Roads Construction",
        "Price": "100 /day",
        "ratings": "5.0",
        "img": "https://i.ibb.co/h9tDn0x/Road-surfacing.jpg",
        "description":[
            {
                "title":"A Look at Road and Highway Design",
                "body":"Road engineers play an important role in building and preserving valuable transportation infrastructure across the nation. Their work allows people to travel safely and transport vital products and resources on the ground. As the American Society of Civil Engineers (ASCE) reported, U.S. highways and roads move 72% — or roughly $17 trillion — of the country’s goods There is a problem, however. An increasing volume of traffic and lack of road repair and expansion has left 43% of those public roadways in poor or mediocre condition. Frequent natural disasters and severe weather events also continue to damage these roadways, impacting people’s safety and America’s economy. While $29 billion of federal funds were allocated to state governments for highway improvements in 2020, there is still much work to be done. That means engineers will be needed to lead the charge in improving and maintaining roads and highways for billions of Americans. A Master of Science in Civil Engineering degree can teach prospective civil engineers innovative strategies, tools, and procedures for success in their careers and to help bolster U.S. road infrastructure. Highway Design  With the advancement of technology, a large majority of civil engineers are designing roads and highways using civil design software. There are a variety of design technologies. Some of these include singular platforms with civil engineer-oriented computer-aided design (CAD) technologies, while others are multi-software platforms that are tailored to fit basic design needs. In considering the most appropriate civil design software, it’s important for road engineers to know exactly the type of projects that are being proposed and match these with the abilities and outputs of the design software. To help with this process, teams should decide on factors such as how often they plan on using the software, whether they’re seeking a simple add-on or an extensive platform, and the overall purpose of the software.  Civil design teams will also want to consider these other factors   Client Preference Some clients may have particular requirements in regard to how their infrastructures are designed. Thus, if you’re running CAD software that they’re uncomfortable with, they might select a company that can more successfully meet their needs. Note: Some add-on design software can run parallel or on-top of CAD platforms, so adhering to client preference is not entirely as difficult as it may sound. Employees CAD Skill Level Naturally, some employees — especially recent graduates — will have been trained on only one CAD software system. Thus, learning a new system could be quite a process. To keep training delays to a minimum, engineering teams may want to consider purchasing the most popular software the industry offers. Cost   Civil engineering design technologies can be extremely expensive, so teams should keep in mind which offers the best long-term return on investment. Technological Resources  CAD files can be quite massive. If computers don’t have enough bandwidth, these large files could slow down overall performance. To prevent this, teams should consider their current technological resources, such as computer hardware, external hard drives, bandwidth extension, and memory upgrades. Highway Repair   As mentioned, America’s roads and highways are in dire need of repair. According to ASCE, there are currently more than four million miles of public roadways, yet almost half of them need to be improved. These inferior roads alone are costing American travelers nearly $130 billion each year on vehicle repairs and operating costs. In addition to the design aspect, road engineers are responsible for the continuous maintenance and upgrades to the existing road infrastructure. These civil engineers utilize some of the most recent resources and strategies in the industr  A 2020 study in the Journal of Traffic and Transportation Engineering, for example, found that road civil engineers should consider using asphalt pavement of over 70 cm thickness to improve the lifespans of high-traffic roads. Meanwhile, McKinsey & Company noted that advanced materials such as plastic mixed with asphalt can make roads up to 60% more durable than the conventional asphalt that’s typically been used. Also, the World Resources Institute for Sustainable Cities suggested that design aspects such as shorter blocks, narrower lanes, and speed humps can be used to improve travel and save lives."
            }
        ]
    },
    {
        "title": "Airport construction work",
        "Price": "200 /day",
        "ratings": "4.7",
        "img": "https://i.ibb.co/tBqLRWS/airport.jpg",
        "description": [
            {
                "title": "Engineering sustainable, operations-friendly airports.",
                "body": "as aviation specialists, we are intimately familiar with Federal Aviation Administration (FAA) project documentation and standard requirements for the design and construction of airport projects. Our aviation team works exclusively on airports, always including aviation safety and construction phasing considerations in our designs to ensure seamless airfield construction projects. Our team also routinely provides design and construction services for projects that occur outside of the aircraft operation areas, such as municipal utilities and automobile parking and access areas. We're committed to sustainable design solutions and understand how our actions intersect with the environment – locally, regionally and globally. We include sustainability best management practices in our airport projects to safeguard the environment, conserve energy and resources, minimize waste, and limit impacts to the surrounding environment."
            }
        ]
    },
    {
        "title": "Bridge construction",
        "Price": "150 /day",
        "ratings": "4.5",
        "img": "https://i.ibb.co/r5yYLTS/bridge-construction.jpg",
        "description":[
            {
                "title":"Designing Bridges",
                "body": "The bridge, a connecting structure, creates bonding between different disconnected parts of a country, two banks of the ocean or parts of two countries. A Bridge is a structural marvel which is generally used to pass any type of obstruction that can slow the life of people. From the very beginning, engineers were trying to win over nature and consequently, they have invented bridge structure which can use to overcome the mentioned natural obstacle  Main Parts of a Bridge There are different types of bridge. Different bridge types contain different parts. FOllowings are the main parts of a bridge Deck Abutment  Pile Pier Girder Rail Track To give a preliminary idea of these bridge parts a brief description of each part is given below. Deck A deck is a fundamental part of any bridge to pass vehicle, goods, people etc. from one side to another. Abutment  The support provided at the two ends of a bridge is known aan abutment. Pile For the bridge with pier, the pile is a fundamental component. Pile type foundation is generally needed when the upper soil layer is loose. Pile depth depends on the soil layer. To find the hard soil layer which will make the structure stable, the pile is usually extended to some depth into the hard soil layer. Pier Pier is the compression member which stay above the pile and make the structure stable.Pier generally provides for span at intermediate points.Piers perform two main functions:  Transferring superstructure vertical loads to the foundationResisting to the horizontal forces acting on the bridges.  For bridge pier to pier, distance is the span. Water pressure is the extra pressure which acts onto the pier laterally.  Girder (Box or I-joist) Just like the beam, girder is used in the bridge. It can be two types I-joist and Box. This name has been given because of their shape. I-joist girder type is commonly used in bridges. Box girder can be precast or cast in place and it is generally existing in prestressed condition  Rail Track Normally Road traffic is the main vehicle onto the bridge but if the train needs to be passed through that bridge rail track is the extra component.  Types of Bridges Followings are the main types of bridges. Truss Bridg  Arch Bridges  Suspension Bridges  Cable-Stayed Bridges  Slab Bridges  Box Girder Bridges A brief description of these bridge types is given below. Truss Bridges  Bridges with truss are made by steel two force member with only tension and compression. No bending moment is allowed in this structure. Most stable structural shape for truss is triangular.  Trus  Bridge  Truss Bridge Bungladesh  Arch Bridges Arch bridge mainly exists in compression. Utilizes an aerodynamic system with torsional rigidity. The Sydney Harbour Bridge Australia The Sydney Harbour Bridge Australia Suspension Bridges In suspension bridges, long spans can be provided which is essential in many situations. It gives freedom to the engineer to provide a long span with the help of a cable. Followings are the Basic components of a suspension bridge Structural system:  Stiffening Girder/ Trusses: Longitudinal structures support and distribute moving vehicle loads. Secure aerodynamic stability of the structure.   Main Cables Main cables are connected to girders through hanger rope. These hanger ropes transfer the loads from girder to the main cables. The main function of these main cables to carry these loads to the main towers. Main Towers: Main cables are supported by these intermediate vertical structures and transfer the total load of the bridge to to foundation. Suspension Bridge at Golden Gate  Suspension Bridge at Golden Gate  Cable-Stayed Bridges  It has a lot of similarities to the suspension bridge. But there are few differences between a suspension bridge and cable-stayed bridge. In this case bridge mainly carries the vertical loads acting on the girder. The purpose of the stay cables is to provide intermediate support for the girder and it helps to span a long distance  Cabl Arrangements in Cable Bridge Cable Arrangements in Cable Bridge  Sunshine Skyway Bridge Tampa Bay Florida  Sunshine Skyway Bridge Tampa Bay Florida  Slab Bridges  It is the most common type of bridge. Use in every place where the span is not so long.  Box Girder Bridges  It's a box type girder different from normal I girder and it can easily resist more amount of torsion. This type of bridge contains top deck vertical web bottom slab. Box girder bridge can be subdivided into three basic categories: Single cell box  Multicell box. Box wit struts supporting a cantilever deck."
            }
        ]
    },
    {
        "title": "Dam construction",
        "Price": "120 /day",
        "ratings": "4.9",
        "img": "https://i.ibb.co/W3y3gZw/dam-1.jpg",
        "description":[
            {
                "title":"Dam construction",
                "body":"am construction is often complex and requires a wide range of professionals from different disciplines.Civil engineers are generally responsible for determining the best type of dam for the site, and for producing technical drawings showing the construction process.They will consult with engineering geologists and hydrologists on the technical details of the site and the required specifications dependent on the amount of water involved. Mechanical engineers will be contracted to design the necessary pipework, valves and floodgates.Geotechnical engineers will determine whether the rock or soil below the proposed dam is strong enough to accommodate the weight and for determining possible permeability. In very broad terms, the typical sequence of events for dam construction is as follows: River diversion  Water flowing in a river or stream is diverted to create a dry area in which to construct the dam. Lower flows will be capable of diverting through tunnels or channels built around the side of the dam area, excavated using explosives where necessary.Higher flows may be too difficult to divert using separate channels, so instead a dry pit is formed on one side of the river, leaving the other side open for water to flow through. The dam is constructed in sections, with dry areas built in sequence. Openings are provided in the dam to allow the river to flow through. Foundations  The foundation is built below the original ground level, with weaker soils or rock removed and replaced with stronger materials if necessary. Cracks and fissures in the rock foundations must be filled with grout to stop water leakage. Holes are drilled into the rock and grout pumped into them, spreading outwards and filling the cracks. Building the dam Concrete dams will need a large quantity of ready concrete, so a concrete batching plant is often built on site. Concrete is then transferred to the dam either using a system of conveyor belts or using trucks and cranes. The traditional method of placing the concrete is to pour it into a formwork mould made in the required shape of the dam. The dam is built upwards 1-2 m at a time, and the concrete left to cure before the next section is formed on top.An alternative method is to spread a concrete mix and compact it down using rollers. The dam is raised in steps of around 600 mm at a time. Low concrete walls on the upstream and downstream faces are formed first, with concrete then spread in thin layers in between the walls, before being compacted using rollers.Embankment dams are constructed in a series of thin layers from the bottom upwards. Bulldozers spread fill material in a thin layer, usually 300 mm thick if using earth, or up to 1 m thick for rock-fill. The core of the dam is also constructed in layers so that it maintains the same height as the rest of the dam. A protective layer is formed on the upstream face once the full height has been achieved. This protects against wave damage and often provides waterproofing. Post-construction Once the dam has been constructed the reservoir can then be filled, if it has not been during construction (in the case of high flow rivers). Valves and floodgates must be extensively tested, and the behaviour of the dam must be monitored.   Safety    The Reservoirs Act (1975) is the updated version of the Reservoirs (Safety Provisions) Act (1930), which introduced safety laws for UK reservoirs holding 25,000 cubic metres of water or more The act provides for a panel of civil engineers who are responsible for checking the safety of reservoirs and their dams. Reservoir owners are legally responsible for maintaining safety and for employing civil engineers to regularly monitor them between the panel’s inspections.  Embankment dams can show cracks and bulges on their downstream and upstream faces, which can indicate instability. The appearance of hollows can indicate that the dam has been being overtopped by floodwater with it proceeding to erode the downstream slope. The dam can also be inspected for signs of water leakage underneath which can gradually create an unstable cavity. Concrete dams are built with inspection galleries running through them in the form of a tunnel. These are used by engineers to inspect the condition of the dam from the inside as well as the outside. They examine for any signs of potential problems with the foundation, water leakage, or movement."
            }
        ]
    },
    {
        "title": "Harbors construction",
        "Price": "180 /day",
        "ratings": "4.3",
        "img": "https://i.ibb.co/hX6NBvj/harbors.jpg",
        "description": [
            {
                "title": "harbours and sea works",
                "body":"harbours and sea works harbour also spelled harbor, any part of a body of water and the manmade structures surrounding it that sufficiently shelters a vessel from wind waves and currents, enabling safe anchorage or the discharge and loading of cargo and passengers. The construction of harbours and sea works offers some of the most unusual problems and challenges in civil engineering. The continuous and  immediate presence of the sea provides the engineer with an adversary certain to discover any weakness in the structure built to resist it. Principles of maritime engineering Objectives Hilton Head Island Hilton  Head Island The principal objectives of such works fall broadly into two  classifications: improvement of transportation, and reclamation and conservancy of land. Under the first fall works directed at providing facilities for the safe and economical transfer of cargo and passengers between land vehicles and ships; fishing ports for the landing and distribution of the harvest of the sea harbours of refuge for ships and small craft and marinas for the mooring or laying up of small private craft. Under the heading of reclamation and conservancy come works  directed to the protection of the land area from encroachment by the sea to the recovery and conversion to land use of areas occupied by the sea and to the maintenance of river estuaries as efficient means forther discharge of inland runoff. In many places without continuous attention to such maintenance the coincidence of high tides with heavy rainfall would lead to frequent disastrous flooding of inhabited areas. The civil engineering techniques used for either of these objectives are broadly similar and indeed the realization of both objectives at the same time will frequently be a feature of the same project. An operation of maintaining a river estuary at a depth sufficient for navigation for example may at the same time greatly improve its capacity for the drainage of upland floodwaters. Hydraulic models The planning of  maritime civil engineering works whether for transportation reclamation or conservancy has been facilitated by the development of the technique of model studies. Once regarded as scientific toys such studies are now considered an essential preliminary step to any large-scale redevelopment of a port or coastal area and are useful eve for minor modifications  additions "
            }
        ]
    },
    {
        "title": "Power Plant Construction",
        "Price": "230 /day",
        "ratings": "4.9",
        "img": "https://i.ibb.co/7rxH7cw/power-plant.jpg",
        "description":[
            {
                "title":"Power Station Construction",
                "body":"Power Plant Engineering or Power Plant Engineering (English: Power Plant Engineering) abbreviated as TPTL is a branch of the field of Energy engineering , and is defined as the engineering and technology required for the production of an electric power station.[1] Technique is focused on power generation for industry and community, not just for household electricity production. This field is a discipline field using the theoretical basis of mechanical engineering and electrical. The engineering aspects of power generation have developed with technology and are becoming more and more complicated. The introduction of nuclear technology and other existing technology advances have made it possible for power to be created in more ways and on a larger scale than was previously possible. Assignment of different types of engineers for the design, construction, and operation of new power plants depending on the type of system being built, such as whether it is power generation fueled fossil, [[NPP] |nuclear power plant]"
            }
        ]
    },
    {
        "title": "RailWay Construction",
        "Price": "110 /day",
        "ratings": "5.0",
        "img": "https://i.ibb.co/HLySKqP/railway.jpg",
        "description": [
            {
                "title": "Construction of a New Railway Line",
                "body":"Earth Work The formation may be in an embankment or a cutting depending upon the general topography of the area A formation in an embankment is   normally preferred from the point of view of good drainage. The heigh  of embankment above highest water in the area should be at least 60cm. Plate Laying The operation of laying out of the rails and sleepers over the ready formation is known as plate laying. The point from where the laying of track starts is known as the base and the point upon which the new track is carried out is known as the rail head. Methods of plate laying: Tramline method or side method Telescopic method American method Laying of Ballast The ballast is normally spread on the railway lines after the embankment has settled well and at least monsoons have passed  over it. The work of spread the ballast is done by means of ballast  trains which have special hoopers through which the ballast can be  automatically unloaded onto the track. Alternatively ballast is loaded in wagons of the train and then unloaded at the site into a number of heaps at suitable intervals along the track. Then packing of ballast is done by the workers by means of shovels. Track Drainage Track drainage can be defined as the interception collection and disposal of water from upon or under the track. It is accomplished by installing a proper surface drainage and sub-surface drainage system. Sources of water in a railway track. Surface water due to rain dew snow. Seepage water from adjacent area. Moisture sucked up by capillary action resulting in increase of moisture in the subgrade or embankment. Hygroscopic water or   held water. Rain water surface. Track Drainage System A good track drainage system shouls ensure that no water percolates into the track at either the surface or the sub-surface levels. The efficiency of a modern  track depends upon the strength and stability of the formation which in turn depends upon the good track drainage. Track drainage should be handled in two distinctive phases: Surface Drainage Sub-surface Drainage Surface Drainage Surface water due to rain snow or from adjacent areas should be drained off properly by designing well-planned and effective surface drains. For bank and formation good quality soil having well graded particles and high internal friction should be used. The soil should not swell or shrink with variation in moisture content. The surface water is first collected in well designed side drains and cross-drains which is further disposed off at the nearest stream or natural water course. Cross drainage structures like culverts and bridges may be necessary for disposing of the surface water. Sand Piles Sand piles sand drains may be used for the removal of surface water from the embankment. In this method holes of 30cm diameter and 1.8-3.0m deep are made between two rails and on the sides of the rails in the embankment. These holes are filled with coarse sand thus forming sand piles. Functions of sand piles are: To support the track. Sand Piles compact the soil and provide mechanical support to the subgrade just like wooden piles. The drainage of the subgrade also improves as water rises to the surface through the sand piles by capillary action and evaporates. Side drains Side drains should be provided along the track cutting and zero fill locations where in the cess level is not above the ground level Side drain must have an adequate gradient and cross section to enable the free flow of collected water. All side drains should be provided with concrete lining. Objectives of maintenance of railway track The strength of track structure goes on reducing due to high speech of heavy axle loads and repetition of loads. The track structure is subjected to other deteriorating effects like rain water of sun and wind. The wear and tear of rails and rolling stock is bound to take place. The track structure has to bear so many other curvatures speed and load particularly on curves points and crossings. Advantage of Good Maintenance The life of both track as well as of rolling stock increases. The journey becomes easy and comfortable. Increase in safety.Saving in operating costs as fuel consumption is less. Higher speed of trains is achieved. Types of Maintenance Daily maintenance Periodical maintenance Daily Maintenance Maintenance is carried out by the full time staff maintained throughout the year. The use of maintenance gangs all along the railway track is made. The railway track is divided into suitable sectons5-6km length. To check the rail gauge. To check the joints. To check the fittings of sleepers and rails. Periodical Maintenance Periodic maintenance is carried out after an interval of two or three years. Levelling of rails Track alignment Gauge Proper Drainage Track Components Points and crossings"
            }
       
        ]
    }
]